Repository: KarateSnowMachine/qtikz-svn
Catalog: po/ktikz_*.po
Languages: fr

source: A TikZ Editor
fr: Un éditeur TikZ

source: This is a program for creating TikZ (from the LaTeX pgf package) diagrams.
fr: Ceci est un programme pour créer des diagrammes TikZ (du paquet LaTeX pgf).

source: Maintainer
fr: Mainteneur

source: Developer
fr: Développeur

source: TikZ document to open
fr: Document TikZ à ouvrir

# @title:window
source: Configure TikZ Viewer
fr: Configurer la visionneuse KTikZ...

source: A TikZ Viewer
fr: Une visionneuse d'images TikZ

source: This is a plugin for viewing TikZ (from the LaTeX pgf package) diagrams.
fr: Ceci est un plugin pour visionner des diagrammes TikZ (du paquet LaTeX pgf).

# @info:whatsthis
source: <para>Save the document under a new name.</para>
fr: <para>Enregistrer le document sous un nouveau nom.</para>

# @action
source: Configure KTikZ Viewer...
fr: Configurer la visionneuse KTikZ...

# @info
source: Cannot read file <filename>%1</filename>:<nl/><message>%2</message>
fr: Impossible de lire le fichier <filename>%1</filename> :<nl/><message>%2</message>

# @title:window
source: File Read Error
fr: Erreur de lecture du fichier

# @item:inlistbox filter
source: TikZ files
fr: Fichiers TikZ

# @item:inlistbox filter
source: All files
fr: Tous les fichiers

# @title:window
source: Save TikZ Source File As
fr: Enregistrer fichier source TikZ sous

# @info
source: A file named <filename>%1</filename> already exists. Are you sure you want to overwrite it?
fr: Un fichier appelé <filename>%1</filename> existe déjà. Voulez-vous vraiment l'écraser ?

# @action:button
source: Overwrite
fr: Écraser

source: Highlighting
fr: Coloration syntaxique

source: <p>When this option is checked, the default fonts and colors are used in the output.</p>
fr: <para>Lorsque cette option est cochée, les polices et les couleurs définies par défaut seront utilises.</para>

source: &Standard
fr: Par &défaut

source: <p>When this option is checked, the fonts and colors defined below will be used in the output instead of the default ones.</p>
fr: <para>Lorsque cette option est cochée, les polices et les couleurs indiquées ci-dessous seront utilisées au lieu de celles définies par défaut.</para>

source: &Custom
fr: &Personnaliser

source: Change st&yle for:
fr: Changer le st&yle pour :

source: <p>Select the structure appearing in the TikZ code for which you want to change the fonts and colors.</p>
fr: <para>Sélectionnez la structure apparaissant dans le code TikZ pour laquelle vous voulez changer les polices et les couleurs indiquées.</para>

source: <p>Select the font in which the structure that you selected in the box above should be displayed.</p>
fr: <para>Sélectionnez la police pour la structure indiquée ci-dessus.</para>

source: Change &font...
fr: Changer p&olice

source: <p>Select the text color in which the structure that you selected in the box above should be displayed.</p>
fr: <para>Sélectionnez la couleur pour la structure indiquée ci-dessus.</para>

source: Change c&olor...
fr: Changer &couleur

source: Configure Editor
fr: Configurer éditeur

source: Editor
fr: Éditeur

source: <p>Select the font of the main text.</p>
fr: <para>Sélectionner la police du texte principal.</para>

source: Text &font:
fr: &Police texte :

source: Choose...
fr: Sélectionner...

source: <p>Show white spaces in the text by replacing them with special symbols. These symbols will not be saved on disk.</p>
fr: <para>Montrer les caractères blancs (espaces) dans le texte en les remplaçant par des symboles spéciaux. Ces symboles ne seront pas enregistrés sur disque.</para>

source: Show &white spaces
fr: Montrer &espaces

source: <p>Select the color in which the spaces will be shown.</p>
fr: <para>Sélectionnez la couleur dans laquelle les espaces seront montrées.</para>

source: &Use color:
fr: Co&uleur :

source: <p>Show tabulators in the text by replacing them with special symbols. These symbols will not be saved on disk.</p>
fr: <para>Montrer les caractères blancs (tabulateurs) dans le texte en les remplaçant par des symboles spéciaux. Ces symboles ne seront pas enregistrés sur disque.</para>

source: Show &tabulators
fr: Montrer &tabulateurs

source: <p>Select the color in which the tabulators will be shown.</p>
fr: <para>Sélectionnez la couleur dans laquelle les tabulateurs seront montrés.</para>

source: U&se color:
fr: Cou&leur :

source: <p>If the cursor is on a bracket ({[]}), then the corresponding opening/closing bracket will be highlighted.</p>
fr: <para>Lorsque le curseur est sur une parenthèse ({[]}), la parenthèse ouvrante/fermante qui correspond sera illuminée.</para>

source: Show matching &brackets
fr: Montrer pa&renthèses correspondantes

source: <p>Select the color in which the highlighted brackets will be shown.</p>
fr: <para>Sélectionnez la couleur dans laquelle les parenthèses illuminées seront montrées.</para>

source: Use c&olor:
fr: Couleu&r :

source: <p>When the first letters of a TikZ command are typed in the text, a list of possible completions will be shown.</p>
fr: <para>Lorsque vous tapez les premiers caractères d'une commande TikZ dans le texte, une liste des complètements possibles est montrée.</para>

source: Use command &completion
fr: Utiliser &complètement des commandes

source: General
fr: Général

source: <p>Select the maximum number of entries that appear in the "Open Recent" menu. When the number of recently opened files exceeds this limit, the oldest entries will be lost.</p>
fr: <p>Sélectionnez le nombre maximal d'entrées qui apparaîtront dans le menu "Récemment ouvert(s)". Si le nombre de fichiers récemment ouverts est plus large que ce limite, les entrées les plus vieilles seront perdus.</p>

source: &Number of entries in the "Open Recent" menu:
fr: Nombre d'entrées dans le menu "Récemment ouvert(s)" :

source: <p>If this option is checked, a dock widget is available with a list of TikZ commands which you can insert in your code by clicking on them. If this option is not checked, the TikZ commands will be available in a menu instead.</p>
fr: <para>Si cette option est cochée, une barre latérale contenant une liste des commandes TikZ est disponible. Vous pouvez insérer ces commandes dans votre code en les cliquant. Par contre, si cette option n'est pas cochée, les commandes TikZ seront disponibles dans un menu.</para>

source: Show TikZ commands in &dock instead of menu
fr: Montrer les commandes TikZ dans une barre &latérale au lieu du menu

source: (you have to restart this program for this change to take effect)
fr: (vous devez redémarrer ce programme pour appliquer ce changement)

source: <p>Specify whether the preview should be generated automatically or manually. If the option "Automatically" is checked, the TikZ code in the editor is compiled while editing. If the option "Manually" is checked, a "Build" button is available and the TikZ code is only compiled when you press that button.</p>
fr: <p>Précisez si l'aperçu doit être généré automatiquement ou manuellement. Si l'option "Automatiquement" est cochée, le code TikZ dans l'éditeur est compilé durant l'édition. Par contre, si l'option "Manuellement" est cochée, un bouton "Compiler" est disponible et le code TikZ est compilé seulement lorsque vous appuyez sur ce bouton.</p>

source: Preview generation:
fr: Génération de l'aperçu :

source: <p>If this option is checked, the TikZ code in the editor is compiled while editing.</p>
fr: <p>Si cette option est cochée, le code TikZ dans l'éditeur est compilé durant l'édition.</p>

source: &Automatically
fr: &Automatiquement

source: <p>If this option is checked, a "Build" button is available and the TikZ code is only compiled when you press that button.</p>
fr: <p>Si cette option est cochée, un bouton "Compiler" est disponible et le code TikZ est compilé seulement lorsque vous appuyez sur ce bouton.</p>

source: &Manually
fr: &Manuellement

source: <p>Select the style in which the toolbar will be displayed.</p>
fr: <para>Sélectionnez la couleur dans laquelle les tabulateurs seront montrés.</para>

source: Toolbar st&yle:
fr: Style de la barre d'&outils :

source: Icons only
fr: Icônes seules

source: Text only
fr: &Police texte :

source: Text alongside icons
fr: Texte contre les icônes

source: Text under icons
fr: Texte sous les icônes

source: Commands
fr: Commandes

source: <p>Enter the path to the LaTeX executable here.</p>
fr: <para>Introduisez le chemin d'accès du fichier exécutable de LaTeX.</para>

source: PDF&LaTeX command:
fr: Commande PDF&LaTeX :

source: Browse command
fr: Commande &pdftops :

source: <p>Browse to the LaTeX executable.</p>
fr: <para>Introduisez le chemin d'accès du fichier exécutable de LaTeX.</para>

source: <p>Enter the path to the pdftops executable here.</p>
fr: <para>Introduisez le chemin d'accès du fichier exécutable de pdftops.</para>

source: &Pdftops command:
fr: Commande &pdftops :

source: <p>Browse to the pdftops executable.</p>
fr: <para>Introduisez le chemin d'accès du fichier exécutable de pdftops.</para>

source: Templates
fr: Fichier de &base :

source: <p>Enter the text which will be replaced by the TikZ code in the template here.</p>
fr: <para>Introduisez le texte qui sera remplacé par le code TikZ dans le fichier de base ici.</para>

source: &Replace text:
fr: Texte &remplacé :

source: <p>Enter the path to the executable of the text editor for the template here.</p>
fr: <para>Introduisez le chemin d'accès du fichier exécutable de LaTeX.</para>

source: Editor &command:
fr: Commande &pdftops :

source: <p>Browse to the editor executable.</p>
fr: <para>Introduisez le chemin d'accès du fichier exécutable de pdftops.</para>

source: Help
fr: Aide

source: <p>Enter the path to the file containing the TikZ documentation here.</p>
fr: <para>Introduisez le chemin d'accès du fichier de documentation sur TikZ.</para>

source: &TikZ documentation:
fr: Documentation &TikZ :

source: Browse file
fr: Feuilleter fichier

source: <p>Browse to the file containing the TikZ documentation.</p>
fr: Chercher le fichier contenant la documentation sur TikZ

source: <p>Press this button to search the file containing the TikZ documentation in the TeX directory structure using kpsewhich.</p>
fr: <para>Appuyer sur ce bouton pour chercher le fichier contenant la documentation sur TikZ dans la structure de dossiers TeX avec <application>kpsewhich</application>.</para>

source: &Search
fr: &Chercher

source: Go To Line
fr: Aller à la ligne

source: Close go to line box
fr: Fermer outil <interface>Aller à la ligne</interface>

source: Go to line:
fr: Aller à la ligne :

source: &Go
fr: &Aller

source: Indent Selection
fr: Indenter sélection

source: Using &spaces
fr: Avec &espaces

source: &Number of spaces:
fr: &Nombre d'espaces :

source: Using &tabs
fr: Avec &tabs

source: Num&ber of tabs:
fr: Nom&bre de tabs :

source: Find and Replace
fr: Chercher et remplacer

source: Close find and replace box
fr: Fermer outil <interface>Chercher et remplacer</interface>

source: Find:
fr: Chercher :

source: &Whole words
fr: Mots &entiers

source: &Case sensitive
fr: Tenir compte de la c&asse

source: Replace with:
fr: Remplacer par :

source: Search backward
fr: Chercher en arrière

source: Search forward
fr: Chercher en avant

source: &Find
fr: &Chercher

source: &Replace
fr: &Remplacer

# @item:inmenu
source: &File
fr: &Fichier

# @item:inmenu
source: &Edit
fr: &Édition

# @item:inmenu
source: &View
fr: Afficha&ge

# @item:inmenu
source: &Go
fr: &Aller

# @item:inmenu
source: &Process
fr: &Processus

# @item:inmenu
source: &Settings
fr: &Options

# @item:inmenu
source: &Sidebars
fr: Barres &latérales

# @item:inmenu
source: &Help
fr: &Aide

source: File Toolbar
fr: Barre d'outils <resource>Fichier</resource>

source: Edit Toolbar
fr: Barre d'outils <resource>Éditeur</resource>

source: Process Toolbar
fr: Barre d'outils <resource>Processus</resource>

source: View Toolbar
fr: Barre d'outils <resource>Affichage</resource>

source: Whether the TikZ commands should be listed in a dock widget instead of in a menu.
fr: Montrer les commandes TikZ dans une barre latérale au lieu du menu.

source: The path to the pdflatex command.
fr: Le chemin d'accès du fichier exécutable de pdflatex.

source: The path to the pdftops command.
fr: Le chemin d'accès du fichier exécutable de pdftops.

source: The path to the TikZ documentation file.
fr: Le chemin d'accès de la documentation TikZ.

source: Whether to run pdflatex with the --shell-escape option.
fr: Exécuter pdflatex avec l'option --shell-escape.

source: The file name of the currently used template.
fr: Le nom du fichier de base actuellement en utilisation.

source: The list of file names of the previously used templates.
fr: La liste des noms des fichiers de base utilisés précédemment.

source: The text in the template file which is replaced by the TikZ code before typesetting.
fr: Le texte dans le fichier de base qui est remplacé par le code TikZ avant de compiler.

source: The font of the main text in the editor.
fr: La police du texte principal dans l'éditeur.

source: Whether to show white spaces.
fr: Montrer les caractères blancs (espaces).

source: Whether to show tabulators.
fr: Montrer les caractères blancs (tabulateurs).

source: Whether to highlight matching brackets.
fr: Illuminer parenthèses correspondantes.

source: The color used to highlight white spaces.
fr: La couleur utilisée pour illuminer les espaces.

source: The color used to highlight tabulators.
fr: La couleur utilisée pour illuminer les tabulateurs.

source: The color used to highlight matching brackets.
fr: La couleur utilisée pour illuminer les parenthèses correspondantes.

source: Whether to use TikZ code completion.
fr: Utiliser complètement des commandes.

source: The type of syntax highlighting.
fr: Le type de coloration syntaxique.

source: The factor by which the preview is zoomed.
fr: Le facteur avec lequel l'aperçu est agrandi ou rétréci.

source: Choose Template
fr: Sélectionner fichier de base

source: <p>Give the file name of the LaTeX template. If this input field is empty or contains an invalid file name, an internal default template will be used.</p>
fr: <para>Introduisez le nom du fichier de base LaTeX. Si le champ de saisie est vide ou contient un nom de fichier invalide, un fichier de base interne sera utilisé.</para>

source: &Template:
fr: Fichier de &base :

source: <p>Select template file</p>
fr: <para>Éditer fichier de base</para>

source: <p>Browse to an existing template file.</p>
fr: <para>Ouvrir un fichier existant.</para>

source: <p>Reload template file</p>
fr: <para>Éditer fichier de base</para>

source: <p>Reload current template file.</p>
fr: <para>Éditer fichier de base</para>

source: <p>Edit template file</p>
fr: <para>Éditer fichier de base</para>

source: <p>Edit this template with an external editor specified in the "Configure" dialog.</p>
fr: <para>Éditez ce fichier de base avec un éditeur externe (l'éditeur par défaut).</para>

source: Edit
fr: &Édition

source: Configure TikZ Viewer
fr: Configurer la visionneuse KTikZ...

source: &Editor command:
fr: Commande &pdftops :

# @title
source: Main Toolbar
fr: Barre principale

# NAME OF TRANSLATORS
source: Your names
fr: Glad Deschrijver

# EMAIL OF TRANSLATORS
source: Your emails
fr: glad.deschrijver@gmail.com

source: &Insert
fr: &Insérer

source: <icode>foreach</icode> with iteration
fr: <icode>foreach</icode> avec itération

source: <icode>foreach</icode> with custom text
fr: <icode>foreach</icode> avec texte personnalisé

source: &Draw
fr: &Tirer une ligne

source: Specify &coordinate
fr: &Spécifier coordonnées

source: &Node
fr: &Nœud

source: &Clip and draw the clipping contours
fr: &Clipper et tirer les lignes de contour

source: Draw &line between two points
fr: Tirer &ligne entre deux points

source: Draw p&olygon
fr: Tirer &polygone

source: &Clip rectangle
fr: &Clipper rectangle

source: Draw &to Next Point
fr: Tirer &vers prochain point

source: &Move to point
fr: &Repositioner vers point

source: &Move to relative point
fr: &Repositioner vers point relatif

source: &Line to
fr: &Ligne vers

source: &Line to relative point
fr: &Ligne vers point relatif

source: &Line to node
fr: &Ligne vers nœud

source: &Line to node with anchor
fr: &Ligne vers nœud avec ancrage

source: C&urve to
fr: Co&urbe vers

source: C&ycle
fr: C&ycler

source: &To
fr: &Aller

source: &Plot
fr: &Tracer

source: &Function
fr: &Fonction

source: &Plot function
fr: &Tracer fonction

source: &Specifying Coordinates
fr: &Spécifier coordonnées

source: &Absolute point
fr: Point &absolu

source: Point &relative to initial position
fr: Point &relatif à la position initiale

source: Point &relative to previous position
fr: Point &relatif à la position précédente

source: &Polar coordinates
fr: Coordonnées &polaires

source: &Intersection of two lines
fr: &Intersection de deux lignes

source: &Curves
fr: &Courbes

source: &Circle
fr: &Cercle

source: &Parabola
fr: &Parabole

source: &Sine curve in [0, pi/2]
fr: &Sinus dans [0, pi/2]

source: &Cosine curve in [0, pi/2]
fr: &Cosinus dans [0, pi/2]

source: &Grid
fr: &Quadrillage

source: &Arrows
fr: &Flèches

source: &Shorten start of line
fr: &Rétrécir début du ligne

source: &Shorten end of line
fr: &Rétrécir fin du ligne

source: Define style for &every path
fr: Définir style pour &chaque courbe

source: &Node Options
fr: Options &nœuds

source: Set node at &start of path
fr: Mettre nœud au &début de la courbe

source: Set node very near &start of path
fr: Mettre nœud très près du &début de la courbe

source: Set node near &start of path
fr: Mettre nœud près du &début de la courbe

source: Set node &midway path
fr: Mettre nœud à &mi-chemin de la courbe

source: Set node near &end of path
fr: Mettre nœud près de la &fin de la courbe

source: Set node very near &end of path
fr: Mettre nœud très près de la &fin de la courbe

source: Set node at &end of path
fr: Mettre nœud à la &fin de la courbe

source: Set relative &position of node on path
fr: Définir &position relative du nœud sur la courbe

source: Set &text width in node
fr: Définir largeur du &texte dans le nœud

source: Set &text in node justified
fr: Justifier &texte dans le nœud

source: Align &text in node to the left
fr: Aligner &texte dans le nœud vers la gauche

source: Align &text to the left without hyphenation
fr: Aligner &texte dans le nœud vers la gauche sans césures

source: Center &text in node
fr: Centrer &texte dans le nœud

source: Center &text without hyphenation
fr: Centrer &texte dans le nœud sans césures

source: Set &text height in node
fr: Définir hauteur du &texte dans le nœud

source: Set &text depth in node
fr: Définir profondeur du &texte dans le nœud

source: Set &separation between text and node shape
fr: Définir &séparation entre le texte et le contour du nœud

source: Set &separation outside node shape
fr: Définir &séparation à l'exterieur du nœud

source: Set minimum &height of node
fr: Définir &hauteur minimale du nœud

source: Set minimum &width of node
fr: Définir &largeur minimale du nœud

source: Set node &sloped in the direction of path
fr: &Incliner nœud dans la direction de la courbe

source: Set &shape of node
fr: Définir la &forme du nœud

source: &Define style for every node
fr: &Définir style pour chaque nœud

source: &Define style for every <shape> node
fr: &Définir style pour chaque nœud ayant une certaine forme

source: &Line Options
fr: &Options ligne

source: Maximal length of &miter join
fr: Longueur maximale des enjoignements <icode>&miter</icode>

source: &Plot Options
fr: &Options traçage

source: &Dash Patterns
fr: Patrons &tirets

source: &Equal lines
fr: Lignes &égaux

source: &Alternating lines
fr: Lignes &alternantes

source: S&hift dash start
fr: &Repositionner le début du tiret

source: &Shade Options
fr: Patrons &ombrage

source: &Snaked Lines Options
fr: Options &serpentines

source: &Path Options
fr: Options &courbe

source: &Transformations on Subsequent Objects in Path
fr: &Transformations sur les objets suivantes d'une courbe

source: S&hift horizontally
fr: &Translation horizontale

source: S&hift vertically
fr: &Translation verticale

source: S&hift to a point
fr: &Translation vers un point

source: &Cancel all transformations except shift
fr: &Annuler toutes les transformations sauf les translations

source: &Rotate by angle
fr: &Rotation avec angle

source: &Rotate around a point
fr: &Rotation autour d'un point

source: S&cale horizontally
fr: A&grandir/rétrécir horizontalement

source: S&cale vertically
fr: A&grandir/rétrécir verticalement

source: S&cale in both directions
fr: A&grandir/rétrécir dans les deux directions

source: &Flip horizontally
fr: &Symétrie horizontale

source: &Flip vertically
fr: &Symétrie verticale

source: &Slant horizontally
fr: &Obliquer horizontalement

source: &Slant vertically
fr: &Obliquer verticalement

source: C&oordinate transformation
fr: Transformation des c&oordonnées

source: Para&bola Options
fr: Options para&bole

source: Parabola with specified &width and height
fr: Parabole avec &largeur et hauteur définies

source: &Grid Options
fr: Options &quadrillage

source: Draw "subdued" &grid with specified step
fr: Tirer &quadrillage à distances définies

source: &To Options
fr: Options <icode>&to</icode>

source: <icode>to</icode> curved with &label
fr: <icode>to</icode> courbé avec &label

source: <icode>to</icode> curved with <icode>to &path</icode>
fr: <icode>to</icode> courbé avec <icode>to &path</icode>

source: &Define style for every to
fr: &Définir style pour chaque <icode>to</icode>
